let announcement = [
  {
    no: '공지1',
    member:{username: '관리자', name: "admin"},
    createDate: "2023-11-07",
    title: "[공지사항] (주) oooo 소개",
    content: 
      `
      안녕하세요 OOOO 입니다.

      OOOO은 2023년 11월 16일에 설립하여 쉬지 않고 달릴 예정입니다.

      거래에 가장 중요한 안전성, 신뢰를 우선으로,
      고객님들의 말에 귀를 기울여 다양한 서비스로 보답하겠습니다.

      감사합니다.
      `
  },

  {
    no: '공지2',
    member:{username: '관리자', name: "admin"},
    createDate: "2023-11-07",
    title: "[공지사항] 반드시 지켜야 될 사항에 대해 알려드립니다.",
    content: 
      `
      안녕하세요 

      게임 거래소 사이트명입니다.

      직거래로 판단되는 게시글, 채팅, 신고 적발시 사이트 이용에 제한이 있을 수 있습니다.

      또한 해당 사이트 내의 흥정채팅 기능을 악용하여 직거래 후 발생되는 사기피해에 대해서는 어떠한 정보 및 도움을 드릴 수 없으니 
      안전하게 사이트 내 마일리지 충전 후 구매요청으로 거래 부탁드립니다.

      (직거래시 대부분 사기피해를 입습니다. 당사에서는 회원님들의 사기피해를 막기위한 정책으로 수립되었습니다.)

      ⭐아래는 직거래로 판단되는 목록입니다⭐

      - 카카오톡 노출(오픈 카카오톡 관련도 포함) / 사이트 내 채팅으로 사진전송 및 물품 상세 페이지에 첨부 가능합니다.
      - 연락처
      - 할부거래
      - 삽니다 글
      - 예약
      - 대리, 육성대리
      - 구매요청 전 게임 접속 행위
      - 게임 내 아이디, 닉네임 등등
      - 개인정보가 포함된 모든것
      - 판매코드, 구매코드(제 3자 사기)
      - 개인 간 직거래 유도(지역 문의 등등)
      - 다은 거래 유도 (개인간 상품권 거래, 토스, 네이버페이)
      - 타 사이트 및 플랫폼 유도(디스코드, 중고나라, 번개나라 등등)

      또한 채팅 내 비방 욕설 험담 또한 정책 위반에 해당합니다.

      해당 내용을 숙지 후 채팅 차단 해지 요청글을 1:1문의에 남겨주시면 답변드리도록 하겠습니다.

      구매요청시 서로의 연락처를 알 수 있으니 참고 후 안전거래 부탁드립니다.
      `
  },

  {
    no: '공지3',
    member:{username: '관리자', name: "admin"},
    createDate: "2023-11-07",
    title: "[공지사항] 오픈 이벤트",
    content: 
      `
      안녕하세요 

      게임 거래소 사이트명입니다.

      우선 저희 사이트를 이용해주셔서 감사합니다.

      사이트 오픈 이벤트로 마일리지 충전시 수수료 0원 이벤트를 실시합니다.

      결제방식은 8가지이며, 많은 이용부탁드립니다.
      `
  },
  {
    no: '공지4',
    member:{username: '관리자', name: "admin"},
    createDate: "2023-11-07",
    title: "[공지사항] 공지4",
    content: 
      `
      안녕하세요 

      게임 거래소 사이트명입니다.

      우선 저희 사이트를 이용해주셔서 감사합니다.

      나머지 쏼라쏼라
      `
  },
  {
  no: '공지5',
  member:{username: '관리자', name: "admin"},
  createDate: "2023-11-07",
  title: "[공지사항] 공지5",
  content: 
    `
    안녕하세요 

    게임 거래소 사이트명입니다.

    우선 저희 사이트를 이용해주셔서 감사합니다.

    나머지 쏼라쏼라
    `
  }
]

export default announcement;

