function PolicyAgree() {
  const PolicyAgreeText =`
  
바㉣로그인컴퍼니(이하 ‘회사’라 한다)는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법 등 관련 법령에 따라 이용자의 개인정보를 보호하고, 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 다음과 같이 개인정보 처리방침을 수립하여 공개합니다.

1. 개인정보의 수집·이용
이용자의 개인정보는 서비스 이용 시에 동의 절차를 거쳐 이용자의 직접 입력 또는 온라인 상의 문서작성을 통해 수집됩니다.
또한 고객센터를 통한 상담과정에서 웹 페이지, 애플리케이션, 이메일, 팩스, 전화를 통해 개인정보가 수집될 수 있습니다.

① 회원 개인정보의 수집·이용 목적과 개인정보 항목은 아래와 같습니다.

바㉣로그인 (공통)

수집·이용 목적

회원 가입 의사 확인,
이용자 식별,
회원제 서비스 제공
본인확인

수집·이용 항목
아이디, 비밀번호, 이름, 휴대전화번호, 전자우편주소, 출금계좌번호, 

② 회사는 서비스 제공을 위하여 수집한 모든 개인정보와 생성정보를 아래의 목적으로 이용합니다.

- 회원 가입 의사 확인, 이용자 식별, 본인확인, 회원제 서비스 제공, 회원관리
- 서비스 제공, 서비스 개선, 신규 서비스 개발
- 민원처리 및 고객상담
- 고지사항 전달
- 불법 및 부정이용 방지
- 서비스 방문 및 이용기록 통계 및 분석
- 서비스 만족도 조사 및 관리
- 알림 서비스


2. 개인정보의 제 3자 제공
회사는 이용자들의 개인정보를 수집·이용 목적의 범위 내에서 사용하며, 이용자의 사전 동의 없이는 동 범위를 초과하여 이용하거나 원칙적으로 이용자의 개인정보를 외부에 제공하지 않습니다. 다만, 아래의 경우에는 예외로 합니다.

1. 이용자가 사전에 동의한 경우

-정보수집 또는 정보제공 이전에 회원에게 비즈니스 파트너가 누구인지, 어떤 정보가 왜 필요한지, 언제까지 어떻게 보호/관리되는지 알리고 동의를 구하는 절차를 거치며, 회원이 동의하지 않는 경우에는 추가 정보를 수집하거나 비즈니스 파트너와 공유하지 않습니다.

2. 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우

3. 이용목적에 부합하는 개인정보의 이용 및 제공

- 도메인, 키워드, SSL의 등록을 위하여 해당 서비스 등록사업자에게 신청자의 정보를 제공하는 경우

- 분쟁에 연루된 등록자의 연락처를 분쟁 조정 기구나 법원이 요청하는 경우

- 당사 홈페이지에서 이용하는 서비스 이용 약관 및 기타 회원 서비스 등의 이용약관 또는 운영 원칙을 위반한 경우

- 당사 서비스를 이용하여 타인에게 정신적,물질적 피해를 줌으로서 그에 대한 법적인 조치를 취하기 위하여 개인정보를 제공해야 된다고 판단되는 충분한 근거가 있는 경우 

- 정부기관이 해당 법률에서 정하는 소관업무를 수행하기 위하여 도메인 이름 및 네임서버 정보 등을 요청하는 경우

- 업무상 연락을 위하여 회원의 정보(성명, 주소, 전화번호)를 사용하는 경우

- 통계작성, 홍보자료, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정 고객임을 식별할 수 없는 형태로 제공하는 경우

3. 개인정보의 보유 및 이용 기간, 개인정보의 파기절차 및 방법

(1) 회사는 이용자의 개인정보를 원칙적으로 보유·이용기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.
(2) 이용자가 개인정보 수집·이용에 대한 동의를 철회하는 경우, 회사는 수집한 이용자의 개인정보를 지체없이 파기합니다.
(3) 이용자로부터 동의 받은 개인정보 보유 기간이 경과하거나 처리 목적이 달성되었음에도 불구하고 다른 법령 또는 회사 내부정책에 따라 개인정보를 일정기간 보존하여야 하는 경우에는 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.

가. 법령에 의하여 수집·이용되는 이용자의 정보

① 통신비밀보호법 

법원의 영장을 받아 수사기관이 요청 시 제공(로그기록, 접속지 정보 등)

② 전자상거래 등에서의 소비자 보호에 관한 법률

대금결제 및 재화 등의 공급에 관한 기록
대금결제 및 재화 등의 공급 기록(5년)

나. 회사 내부정책에 의하여 수집·이용되는 이용자의 정보

① 회사 내부정책

회원가입남용 (부정 이용 방지)  아이디, DI 회원탈퇴 후 3년


(4) 회사는 ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률 제29조’ 에 근거하여 1년 동안 회사의 서비스를 이용하지 않은 이용자의 개인정보를 이용자에게 사전통지하고 개인정보를 파기하거나 별도로 분리하여 저장 합니다.
* 회사는 개인정보가 파기되거나 분리되어 저장•관리된다는 사실, 서비스 미이용 기간 만료일, 해당 개인정보의 항목을 공지사항, 전자우편 등의 방법으로 미이용 기간 30일 전에 이용자에게 알립니다.
이를 위해 이용자는 회사에게 정확한 연락처 정보를 알리거나 수정하여야 합니다.

(5) 개인정보 파기의 절차 및 방법은 다음과 같습니다.
① 파기절차
회사는 파기 사유가 발생한 시점부터 별도 지정한 보유·이용기간이 지난 시점에 지체없이 파기합니다.
② 파기방법
회사는 전자적 파일형태로 기록·저장된 개인정보는 기록을 재생할 수 없도록 기술적인 방법 또는 물리적인 방법을 이용하여 파기하며, 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각 등을 통하여 파기합니다.


4. 이용자의 권리와 그 행사방법, 이용자의 의무
(1) 이용자가 직접 자신의 개인정보를 조회, 수정, 삭제하는 것을 원칙으로 하며, 회사는 이를 위한 기능을 제공합니다.

(2) 이용자 및 법정대리인은 개인정보의 조회, 수정, 삭제를 요청할 수 있으며, 회사는 정책에 따라 본인확인 절차를 거쳐 이를 조치하겠습니다.

(3) 이용자가 개인정보의 오류 정정을 요청한 경우에는 정정을 완료하기 전까지 회사는 당해 개인정보를 이용 또는 제공하지 않습니다. 또한, 회사는 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 제3자에게 지체 없이 정정 처리요청을 하겠습니다.

(4) 이용자는 자신의 개인정보를 최신의 상태로 유지해야 하며, 이용자의 부정확한 정보 입력으로 발생하는 문제의 책임은 이용자 자신에게 있습니다.

(5) 타인의 개인정보를 도용한 회원가입의 경우 이용자 자격을 상실하거나 개인정보보호 관련 법령에 의해 처벌 받을 수 있습니다.

(6) 이용자는 아이디, 비밀번호, 전자우편 등 이용자의 개인정보에 대한 보안을 유지할 책임이 있으며 제3자에게 이를 양도하거나 대여 할 수 없습니다. 이용자가 이용자의 개인정보를 제3자에게 양도하거나 대여하여 발생하는 문제의 책임은 이용자에게 있습니다.


5. 기타 개인정보침해에 대한 신고 및 상담

이용자는 아래의 기관에 대해 개인정보 침해에 대한 피해구제, 상담 등을 문의하실 수 있습니다.
아래의 기관은 정부기관 소속으로서, 회사의 자체적인 개인정보 불만처리 또는 개인정보 피해구제 결과에 만족하지 못하실 경우, 자세한 도움이 필요하실 경우에는 문의하여 주시기 바랍니다.

● 개인정보침해신고센터
홈페이지 : http://privacy.kisa.or.kr
전화번호 : (국번없이) 118

● 개인정보분쟁조정위원회
홈페이지 : https://www.kopico.go.kr
전화번호 : 1833-6972

● 대검찰청 사이버수사과
홈페이지 : http://www.spo.go.kr
전화번호 : (국번없이) 1301

● 경찰청 사이버안전국
홈페이지 : http://cyberbureau.police.go.kr
전화번호 : (국번없이) 182

6. 고지의 의무

(1) 현 개인정보처리방침은 법령, 정부의 정책 또는 회사 내부정책 등 필요에 의하여 변경될 수 있으며, 내용 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일전부터 홈페이지의 '공지사항'을 통해 고지할 것입니다.
다만, 이용자 권리의 중요한 변경이 있을 경우에는 최소 30일 전에 고지합니다.`;

  return PolicyAgreeText;
}

export default PolicyAgree;

