function PrivacyAgree() {
  const PrivacyAgreeText = `
제 1 장 총칙

[제1조 (목적)]

이 약관은 OOO가 제공하는 아이디팜(Idfarm) 및 아이템팜(Itemfarm) 제반 서비스(이하 "서비스")의 이용조건 및 절차에 관한 회사와 회원간의 권리 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.

[제2조 (약관의 게시 와 개정)]

1. “회사”는 이 약관의 내용을 “회원”이 쉽게 알 수 있도록 "아이디팜(idfarm)” 회원가입 관련 사이트에 게시하거나 기타의 방법으로 사용자에게 공지하고, 이용자가 회원으로 가입하면서 이 약관에 동의함으로써 효력을 발생합니다.
2. 회사는 “약관의 규제에 관한 법률”, “정보통신망이용촉진 및 정보보호 등에 관한 법률”, 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
3. “회사”가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 제 1 항 규정에 따라 그 개정약관의 적용일자 7일 전부터 적용일자 전일까지 공지합니다. 다만, 회원에게 중요한 약관을 개정하는 경우에는 개정약관의 적용일자 30일전부터 적용일자까지 공지합니다.
4. 회사가 전항에 따라 개정약관을 공지 통지하면서 회원에게 7일간의 기간 내에 의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 명확하게 고지 또는 통지하였음에도 회원이 명시적으로 거부의 의사표시를 하지 아니한 경우 회원이 개정약관에 동의한 것으로 봅니다.
5. “회원”이 개정 약관의 적용에 명시적으로 동의하지 않는 경우 “회사”는 개정 약관의 내용을 적용할 수 없으며, 이 경우 “회원”은 이용계약을 해지할 수 있습니다. 다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 “회사”는 이용계약을 해지할 수 있습니다.


[제3조 (약관 외 준칙)]

이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 전자상거래 등에서의 소비자보호에 관한 법률, 약관의 규제 등에 관한 법률, 공정거래위원회가 제정한 전자상거래 등에서의 소비자보호지침 및 관련 법령의 규정과 일반 상관례에 의합니다. 단 회사가 제공하는 서비스를 통하여 회원 상호간에 이루어진 거래에 대해서는 방문 판매 등에 관한 법률, 전자거래기본법, 소비자 보호법 등 관련 법령이 우선적으로 적용되고 회원은 이 약관의 규정을 들어 거래 상대방에 대하여 면책을 주장할 수 없습니다.

[제 4 조 (이용약관 및 운영정책 등의 해석)]

① “회사”가 운영하는 "아이디팜"에서는 기본적으로 이 약관이 적용되며, 다양한 개별 서비스(ex. 프리미엄 서비스등)에 대해서 별도의 서비스 이용약관 및 운영정책을 둘 수 있습니다. 또한 개별서비스의 이용약관 및 운영정책, 광고서비스 운영원칙, 공지사항 등에 위임할 수 있으며 그 내용을 "회원"에게 게시하여 쉽게 열람할 수 있도록 합니다.
② 개별 서비스의 제공에 관하여는 해당 이용약관 및 운영정책이 이 약관에 우선하여 적용되며, 이 약관은 개별 이용약관 및 운영정책에 반하지 않는 범위 내에서 개별 서비스에 관하여도 적용됩니다. 이러한 내용은 각각의 개별 서비스 초기 화면에서 확인할 수 있습니다.
③ 개별 서비스들의 구체적인 내용은 개별 서비스 이용약관, 개별 서비스 상의 안내, 공지사항, 고객센터, Q&A 등에서 쉽게 확인할 수 있으며, 본 운영정책의 일부에 포함되어 적용됩니다.
④ 개별 서비스에 관한 별도 이용약관 및 운영정책 또는 이 약관에서 정하지 아니한 사항이 있거나 이 약관의 해석에 다툼이 있는 경우 대한민국 법률 및 관계 법령이 있는 경우 이에 따르고 그렇지 아니한 경우 상관례에 따릅니다.


[제5조 (이용계약의 성립)]

1. 이용계약은 “회원”이 되고자 하는 자(이하 “가입신청자”라 함)가 약관의 내용에 동의를 한 다음 “회사”가 정한 절차에 따라 가입신청을 하고, “회사”가 이러한 신청에 대하여 승낙함으로써 체결됩니다.

2. “회사”는 “가입신청자”의 신청에 대하여 “서비스” 이용을 승낙함을 원칙으로 합니다. 다만, “회사”는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
① “가입신청자”가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우. 단, “회사”의 회원 재가입 승낙을 얻은 경우에는 예외로 함
② 실명이 아니거나 타인의 명의를 이용한 경우
③ 허위의 정보를 기재하거나 “회사”가 제시하는 내용을 기재하지 않은 경우
④ “가입신청자”의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
⑤ “회사”는 서비스 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있어 정상적인 “서비스” 제공이 어렵다고 판단되는 경우에는 승낙을 유보할 수 있습니다.
⑥ 제 2 항과 제 4 항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, “회사”는 원칙적으로 이를 “가입신청자”에게 알리도록 합니다.
⑦ 이용계약의 성립 시기는 “회사”가 가입완료를 신청절차 상에서 표시하거나, 제 10 조의 방식에 따른 통지가 “가입신청자”에게 도달한 시점으로 합니다.
⑧ “회사”는 “회원”에 대해 회사정책에 따라 등급별로 구분하여 이용시간, 이용횟수, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.

3. 만 19세 미만은 아이디팜에서 제공하는 게임 아이템거래 관련 서비스 이용이 제한 될 수 있습니다.
4. 회사는 본조5항에서 규정한 미성년자의 아이디팜 서비스 이용 제한 및 판매 물품의 부가가치세법 상의 신고절차 등의 목적으로 관계법령에 의하여 이용자의 실명, 주민등록번호 등의 제공을 요청할 수 있으며, 이러한 회사의 제공 요청을 거부하여 이용자 본인임이 확인되지 않아 발생하게 되는 불이익에 대하여 회사는 책임을 지지 않습니다.
5. 회사는 회사의 책임 있는 사유로 회원이 유료옵션을 이용하는데 과오금이 발생한 경우 이용대금 결제와 동일한 방법으로 과오금을 환급합니다.
6. 회원은 유료옵션의 내용이 표시·광고와 다르거나 계약내용과 다르게 이행된 경우 공급받은 날로부터 3개월 이내, 그 사실을 인지한 날 또는 알 수 있었던 날로부터 30일 이내에 청약철회 등을 할 수 있습니다.

[제 6 조 (회원탈퇴 및 자격상실 등)]

1. 회원은 “아이디팜”에 언제든지 탈퇴를 요청할 수 있으며 “아이디팜”에서는 즉시 회원탈퇴를 처리합니다. 단, 회사는 회원이 회원탈퇴 하기 전에 회원탈퇴 페이지 안내를 통해 관련 절차를 고지할 수 있습니다.
2. 회원이 다음 각 호의 사유에 해당하는 경우, “아이디팜”은 회원자격을 제한 및/또는 정지시킬 수 있습니다.
다음 각 호와 같은 위반행위가 있는 경우

① 타인의 서비스 ID 및 비밀번호를 도용한 경우
② 서비스 운영을 고의적으로 방해한 경우
③ 타인의 명예를 손상시키거나 불이익을 주는 행위를 한 경우
④ 타인의 개인정보, 이용자ID 및 비밀번호로 부정하게 사용하는 경우
⑤ 회사의 서비스 정보를 이용하여 얻은 정보를 회사의 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 경우
⑥ 이용자에 대한 개인정보를 그 동의 없이, 수집, 저장, 공개하는 경우
⑦ 구매의사가 없이 회원의 물품을 구매 신청한 후 구매거부하는 경우
⑧ 회사의 서비스 정보를 통하여 얻은 정보로 타 사이트, 직거래를 유도하는 경우
⑨ 복제품, 해킹물품, 판매목적이 아닌 물품을 등록하는 경우
⑩ 기타 회사의 서비스개선을 위한 회사 정책상 불가피할 경우
⑪ 운영자 또는 관리자가 이용에 부적합하다고 판단하는 경우
⑫범죄와 결부된다고 객관적으로 판단하는 행위
⑬ 기타 관계 법령에 위배되는 행위

3. 서비스 이용 중지 또는 제한 절차

① 회사가 회원자격을 상실시키는 경우에는 회원등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다. 

만약 회원이 통지를 받은 날로부터 30일 내에 소명하고, 그 내용이 정당하다고 회사가 판단하는 경우 회사는 회원 자격을 원복하거나 서비스 이용 중지 또는 제한 조치를 해제하고, 서비스 정지기간만큼 회원의 
서비스 이용기간을 연장해 줍니다.


[제 7 조(회원정보의 변경)]

① “회원”은 회원정보 관리 화면을 통하여 언제든지 본인의 회원정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 실명, 아이디 등은 수정이 불가능합니다.
② “회원”은 회원가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정을 하거나 전자우편 등 기타 방법으로 “회사”에 대하여 그 변경사항을 알려야 합니다.
④ "회원"이 제 1 항, 제 2 항의 변경사항을 “회사”에 알리지 않아 발생한 불이익에 대하여 “회사”는 “회사”의 고의 또는 중대한 과실이 없는 이상 책임지지 않습니다.


[제 8 조 (개인정보보호 의무)]

① “회사”는 “정보통신망법” 등 관계 법령이 정하는 바에 따라 “회원”의 개인정보를 보호하기 위해 노력합니다.
② 개인정보의 보호 및 사용에 대해서는 관계 법령 및 “회사”의 개인정보처리방침이 적용됩니다. 다만 “회사”의 공식 사이트 이외의 링크된 사이트에서는 “회사”의 개인정보처리방침이 적용되지 않습니다.
③ “회사”는 회원의 정보 수집 시 반드시 당해 회원의 동의를 얻어 필요한 최소한의 정보만을 수집하며, 회원은 온라인을 통해서 수시로 본인의 신상정보를 열람, 정정 또는 삭제할 수 있습니다.
④ “회사”가 제3자에게 회원의 개인정보를 제공할 필요가 있는 경우 1) 개인정보를 제공받는 자, 2) 개인정보를 제공받는 자의 개인정보 이용목적, 3) 제공하는 개인정보의 항목, 4) 개인정보를 제공받는 자의 개
인정보 보유 및 이용기간을 회원에게 알리고 동의를 받아야 합니다.


[제 9 조 (“회원”의 “아이디”와 “비밀번호”의 관리에 관한 의무)]

① 생성된 “회원”의 “아이디”와 “비밀번호”에 관한 관리책임은 “회원”에게 있으며, 이를 제 3 자가 이용하도록 하여서는 안 됩니다.
② “회사”는 “회원”의 “아이디”가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나, “회사” 및 “회사”의 운영자로 오인할 우려가 있는 경우, 해당 “아이디”의 이용을 제한할 수 있습니다.
③ “회원”은 “아이디” 및 “비밀번호”가 도용되거나 제 3 자가 사용하고 있음을 인지한 경우에는 이를 즉시 “회사”에 통지하고 “회사”의 안내에 따라야 합니다.
④ 제 3 항의 경우에 해당 “회원”이 “회사”에 그 사실을 통지하지 않거나, 통지한 경우에도 “회사”의 안내에 따르지 않아 발생한 불이익에 대하여 “회사”는 “회사”의 고의 또는 중대한 과실이 없는 이상 책임지지
 않습니다.

[제 10 조(“회원”에 대한 통지)]

① “회사”가 “회원”에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 “회원”이 제공한 전자우편주소, (휴대)전화번호, 주소, “서비스” 로그인 시 동의창 등의 수단으로 통지할 수 있습니다.
② “회사”는 “회원” 전체에 대한 통지의 경우 7 일 이상 “회사”의 게시판에 게시함으로써 제 1 항의 통지에 갈음할 수 있습니다.
③ “회원”은 “회사”에 실제로 연락이 가능한 전자우편, (휴대)전화번호, 주소 등의 정보를 제공하고 해당 정보들을 최신으로 유지하여야 하며 “회사”의 통지를 확인하여야 합니다.
④ 회원정보가 변경되었음에도 해당 사항을 수정하지 않음으로써 발생한 각종 손해와 잘못된 수정으로 인하여 발생한 손해는 당해 회원이 부담하여야 하며, 회사는 이에 대하여 아무런 책임을 지지 않습니다


[제 11 조(“회사”의 의무)]

① “회사”는 관계 법령과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 “서비스”를 제공하기 위하여 최선을 다하여 노력합니다.
② “회사”는 “회원”이 안전하게 “서비스”를 이용할 수 있도록 개인정보(신용정보 포함) 보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다.
③ “회사”는 서비스이용과 관련하여 “회원”으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. “회원”이 제기한 의견이나 불만사항에 대해서는 게시판을 활용하거나 전자우
편 등을 통하여 “회원”에게 처리과정 및 결과를 전달할 수 있습니다.


[제 12 조 (“회원”의 의무)]

① “회원”은 다음 각 호의 행위를 하여서는 안 됩니다.

1. 회원 신청 또는 회원 정보 변경 시 허위내용의 등록
2. 타인의 정보도용
3. “회사”가 게시한 정보의 변경
4. “회사”와 기타 제 3 자의 저작권 등 지적재산권에 대한 침해
5. “회사” 및 기타 제 3 자의 명예를 손상시키거나 업무를 방해하는 행위
6. 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 제2조 제 1호 각목의 서비스 플랫폼 등에 공개 또는 게시하는 행위
7. 기타 불법적이거나 부당한 행위

② “회원”은 관계 법령, 이 약관의 규정, 이용안내 및 “서비스”와 관련하여 “회사”가 공지한 주의사항, “회사”가 통지하는 사항 등을 준수하여야 하며, 기타 “회사”의 업무에 방해되는 행위를 하여서는 안 됩니다.
③ “회원”은 다음 각 호의 방법으로 “회사”의 업무에 방해가 되는 행위를 하여서는 안됩니다.

1. “회사”가 제공하지 않는 방법으로 “서비스”에 접속하는 행위
2. 리버스엔지니어링, 디컴파일, 크롤링, 서비스 거부 공격, 웹 해킹 등을 포함한 제반 해킹공격
3. “회사”가 제공하는 제반 서비스 및 정보를 복제, 분해, 모방 또는 변경하는 행위
4. 자동 접속 프로그램 또는 해킹 프로그램 등을 통해 정상적인 방법과 다른 방법으로 서비스를 이용하여 “회사”의 서버에 부하를 일으키거나 서비스를 방해하는 행위
5. “회사”의 서비스 제공 목적과 부합하지 않는 목적으로 서비스를 이용하여 "회사"의 서버, DB 등 정보처리자원을 소모하게 하는 행위
6. "회사"의 사전 동의 없이 ID, 패스워드를 제3자에게 양도 또는 대여하거나 제3자로부터 양도 또는 대여받아 사용하는 행위
7. 저작권법, 형법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전산망 보급 확장과 이용촉진에 관한 법률, 전기통신사업법 등 통신망, 서버, 소프트웨어 등의 이용과 관련한 법령을 위반하는 행위


[제 13 조 (“서비스”의 제공 등)]
① “서비스”는 "회사"의 업무상 또는 기술상 특별한 사장이 없는 한 연중무휴, 1 일 24 시간 제공함을 원칙으로 합니다.
② 전항에도 불구하고 “회사”는 “서비스”를 일정범위로 분할하여 각 범위별로 이용가능시간을 별도로 지정할 수 있습니다. 다만, 이러한 경우에는 그 내용을 사전에 공지합니다.
③ “회사”는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 장애, 통신두절 또는 운영상 상당한 이유가 있는 경우 “서비스”의 제공을 일시적으로 중단할 수 있습니다. 이 경우 “회사”는 제 10 조 [“회원”에 대한 통지]에 정한 방법으로 “회원”에게 통지합니다. 다만, “회사”가 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.
④ “회사”는 제 3 항에 따른 “서비스” 제공 중단으로 발생한 “회원”의 손해에 대하여 “회사”의 고의 또는 중대한 과실이 없는 한 책임을 지지 않습니다.
⑤ “회사”는 서비스의 제공에 필요한 경우 정기점검을 실시할 수 있으며, 정기점검시간은 서비스제공화면에 공지한 바에 따릅니다.


[제 14 조 (“서비스”의 변경)]
① “회사”는 안정적인 “서비스” 제공을 위한 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부 “서비스”를 변경할 수 있습니다.

② “서비스”의 내용, 이용방법, 이용시간에 대하여 변경이 있는 경우에는 변경사유, 변경될 서비스의 내용 및 제공일자 등을 그 변경 전에 서비스 초기화면에 게시합니다. 

단, “회원”의 권리나 의무 및 “서비스” 이용과 관련되는 실질적인 사항을 변경할 경우 적용일자 7 일 전부터 공지하며, “회원”에게 불리한 변경의 경우 적용일자 30 일 전부터 공지합니다.

③ “회사”는 무료로 제공되는 서비스의 일부 또는 전부를 “회사”의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관계 법령에 특별한 규정이 없는 한 “회원”에게 별도의 보상을 하지 않습니다.


[제15조 (거래점수 및 신용등급)]

1. 회사는 서비스를 통한 거래의 안전성과 신뢰성을 위하여 회원에게 거래점수를 부과합니다.
2. 회원에게 부과된 거래점수는 이용자의 거래상황을 판단하는 기준이 되며, 신용등급은 회원의 실제 신용등급을 참고하여 브론즈, 실버, 골드로 표시됩니다.
3. 회원가입 후 초기에 부여되는 거래점수는 0점입니다.
4. 거래점수의 부여기준은 아래와 같습니다.

① 물품판매에 따른 부과

판매 1건당 거래점수가 1점 상승합니다

② 물품구매에 따른 부과

구매 1건당 거래점수가 1점 상승합니다.

5. 일부 등급에는 거래점수 이외에 필요한 조건이 있습니다.

6. 거래점수 및 신용등급은 항시 공개할 수 있습니다.

7. 거래점수 및 신용등급의 운영정책은 회사가 따로 정하는 바에 의합니다.


[제16조 (벌점)]

1. 회사는 다음의 사유로 인하여 판매자와 구매자에게 벌점을 부과할 수 있습니다.

① 비정상적인 거래 진행
② 판매거부
③ 구매거부
④ 기타 회사의 판단

2. 벌점 부과 내역 및 벌점 현황 등 벌점과 관련된 내용은 회원의 거래 안전을 위하여 홈페이지 등에 공개할 수 있습니다.


[제17조 (물품등록/구매등록)]

1. 회사가 제공하는 서비스를 통하여 물품을 판매 또는 구매하고자 하는 회원은 회사가 제공하는 물품등록 양식에 따라 물품을 등록하여야 합니다.

2. 판매 또는 구매를 목적으로 제출한 물품에 대한 설명에는 거짓이 없어야 하며, 회사가 정하는 양식에 어긋난 등록이나 허위등록으로 인한 손해 또는 손실에 대한 책임은 회원이 부담해야 합니다.

3. 회원은 팔고자 하는 물품에 대하여 정확한 정보를 양식에 맞게 작성하여야 합니다.

4. 회사에서 제공하는 거래방법은 '자율거래' 및 ‘위탁거래’입니다.

5. 회원간 자율거래를 할 때 물품을 전달하거나 인수 시에 발생되는 사고에 대해서는 회사는 일체 책임지지 않습니다.

6. 위탁거래를 할 때 물품을 전달하거나 인수 시에 발생되는 사고에 대해서는 해당 중개에 관련된 중개도우미가 거래에 대한 모든 책임을 지게 됩니다.

7. 자율거래 물품등록 시 판매자가 입력한 핸드폰번호으로 로 연락이 되지 않을 때에는 자율거래가 불가능 합니다.

8. '등록 후'의 물품대금 결제수단으로는 회원이 적립한 ‘마일리지’를 통하여 결제하여야 합니다.

9. 회원은 물품 판매 대금을 송금 받을 수 있는 '출금계좌정보(예금주, 은행명, 계좌 번호 등)'를 정확하게 입력하여야 하며, '출금계좌정보'의 예금주는 판매자의 성명과 동일하여야 합니다. 판매자의 성명과 동일하지 않을 경우 회사에서는 출금을 보류합니다.

10. 물품 등록 및 판매의 제한

① 매매불가 물품 : 법률상 소유가 금지되어 있거나, 거래가 금지되어 있는 물품, 소프트웨어 OEM 제품, 복제품, 장물, 홍보용 무료 또는 할인 상품권, 습득물, 관련법령에 의하여 제작, 유통, 판매가 금지된 성인물, 허가번호 없이 불법 복제된 성인물 및 소프트웨어, 군 형법에 저촉되는 군용품(군복, 대검, 망원경 등), 회원으로부터 신고가 접수되어 회사가 불법물건으로 판단한 물품, 기타 회사가 풍속을 해치거나 판매가 불가능하다고 판단되는 물품은 거래하실 수 없습니다.

11. 부가서비스의 이용

부가서비스의 구체적인 내용에 대해서는 회사가 따로 정하는 바에 의합니다.

1  회사가 제공하는 게임 계정·아이템 중개서비스 이외의 추가 제공 서비스(Ex 전자계약서, 보증 등)로 자체적인 서비스 개발 및 타사와의 업무제휴를 통해 회원들에게 신규 도입, 제공되는 서비스를 말합니다.

2. 회사는 회원들에게 부가서비스를 제공합니다.

3. 프리미엄 물품등록은 회원의 물품을 최상단에 홍보할 수 있도록 물품등록 당시 회원에게 마일리지를 지급 받고 제공하는 유료 서비스로서, 물품리스트 페이지 최상단에 노출 또는 물품 제목의 특수 노출 등 차별화된 방식으로 광고할 수 있는 유료서비스입니다. 본 서비스는 회원등급에 구분 없이 모든 회원이 신청하여 이용 가능하며, 본 서비스 사용 후 환불은 불가능합니다.

4. 전자계약서란 계약 당사자가 계약 내용에 대해 동의했다는 사실을 객관적으로 증명할 수 있는 전자 문서이며 위드싸인 업체와 제휴 된 유료서비스입니다.  판매자가 캐릭터를 회수하는 경우, 구매자는 거래 사실을 객관적으로 증명할 수 있는 전자계약서를 바탕으로 형사/민사 소송을 진행하실 수 있습니다. 본 서비스는 회원등급에 구분 없이 모든 회원이 신청하여 이용 가능하며, 본 서비스 구입 후 환불은 불가능합니다.

5. 보증 서비스는 캐릭터 구입 후 발생할 수 있는, 모든 판매자의 회수에 대비한 유료 서비스입니다. 회수 발생 시 수사결과 통지서 증빙서류를 제출하시면 회사에서 캐릭터 구매금액 100%를 보상해 드립니다. 단, 최초거래(1대와 2대간의)가 아이디팜내에서 거래된 물품에 대해서만 보상이 가능하며, 보상서비스 범위는 1대 -> 2대 -> 3대 의 거래에 대해서만 가능합니다.
사고본 서비스는 회원등급에 구분 없이 모든 회원이 신청하여 이용 가능하며, 본 서비스 사용 후 환불은 불가능합니다.

12. 물품등록정보의 수정

① 등록된 물품정보를 추가하거나 등록된 물품 사진은 거래진행 후에는 변경할 수 없습니다.
② 물품 등록 시 신청한 부가서비스의 취소는 불가능하며 추가만이 가능합니다.
③ 구매자가 선택되어 있는 경우 삭제는 불가능합니다.

12. 계약의 성립

①판매자가 등록한 물품에 대하여 구매자가 구매신청을 한 경우 물품에 대한 계약이 성립한 것으로 봅니다.
②구매자가 등록한 물품에 대하여 판매자가 판매신청을 한 경우 물품에 대한 계약이 성립한 것으로 봅니다.

13. 판매자의 의무와 책임

① 등록한 물품에 대해서는 구매신청한 구매자에게 물품 인계 및 판매할 의무가 있으며, 판매자의 개인적인 사유로 거래를 취소하는 경우, 제16조에서 규정한 판매거부 벌점이 적용됩니다.
② 판매자는 물품 등록 정보에 대한 회원들의 문의에 대해 성실히 답변해 주어야 합니다. 불충분한 설명으로 인한 반품 등의 피해는 판매자의 책임입니다.
③ 판매자는 본인이 등록(판매)한 물품이 해킹이나 사기로 취득한 아이템이거나 매매가 금지된 물품일 경우 이에 대한 모든 민∙형사상의 책임을 집니다.
④ 판매자는 판매하고자 하는 물품의 판매 등록 시 정보통신망법에서 규정하고 있는 회원의 주민등록번호 수집 제한 규정에도 불구하고, 회사가 부가가치세법에 의하여 국세청에 신고하는 판매 자료의 회계 절차상 판매자의 주민등록번호를 1회에 한하여 요청할 수 있습니다. 단, 이 경우 회사는 판매자가 자신의 주민등록번호 제공에 동의한 경우에 한해서만 판매자의 주민등록번호를 제공받으며, 이에 대한 거부 등으로 발생하는 손해에 대한 책임은 판매자에게 있습니다.


[제18조 거래진행]

1. 구매자 통보

① 구매자는 구매하고자 하는 물품을 선택한 후 회사가 정한 시간 안에 회사에 입금을 해야 하며, 입금 시에는 회사가 원하는 입금정보(카드결제의 경우: 카드번호, 비밀번호, 카드유효기간, 현금결제의경우: 입금일, 입금은행, 입금자명, 입금금액, 휴대폰결제의 경우 : 휴대폰번호, 휴대폰명의자의 생년월일, 가입한 이동통신회사)를 기재하여야 합니다.
② 현금 결제 시 입금에 대한 입금수수료 또는 PG사의 결제수수료(구매자가 물품대금을 회사로 입금하면서 발생하는 은행 입금수수료 또는 PG를 이용한 충전 시 발생하는 수수료)는 구매자가 구매금액을 회사에 입금할 때 회원이 부담해야 하며, 절대 환불되지 않습니다.

2. 판매자의 물품 전달

① 회사로부터 구매자의 입금 확인 및 물품 인계요청 통지를 받은 판매자 및 중개도우미는 구매자에게 물품을 안전하게 인계할 의무가 있습니다.
② 회사로부터 물품 전달 요청 통지를 받은 판매자 및 중개도우미는 통지 받은 시간으로부터 1시간 이내에 구매자에게 물품을 전달해야 합니다. 단, 판매자는 구매자로부터 거래취소 요청이 있는 경우 본 조 제5항 3호에 따라 구매자와 합의하여야 하며, 거래취소 요청시간으로부터 1시간이 경과하여도 판매자가 입력한 핸드폰번호로 연락이 되지 않는 경우 해당 거래는 자동으로 취소 될 수 있습니다.
③ 판매자 및 구매자는 상호 연락을 통하여, 거래일 시간 등을 협의하여야 합니다.
④ 판매자 및 중개도우미가 물품을 물품전달 마감시간 이내에 전달하지 않을 경우, 회사는 판매거부로 간주하고 거래를 취소할 수 있습니다. 
⑤ 판매자가 물품 전달을 하지 않아 발생하는 손해에 대한 모든 책임은 판매자가 책임져야 합니다.
⑥ 판매자가 물품 전달 지연에 대하여 "회사"는 아무런 책임이 없으며 물품 전달 지연으로 인하여 구매자에게 피해를 주었을 경우 판매자가 책임집니다.
⑦ 판매자가 물품을 전달하였음에도 불구하고, 게임 개발 서비스 업체의 서비스 이상으로 구매자가 물품을 전달 받지 못한 경우, 구매자는 즉시 회사로 판매자에 대한 대금지급 중지신청을 하여야 합니다. 구매자가 대금지급 중지신청을 하지 않거나 회사가 대금지급을 한 후에 중지신청을 한 경우에, 회사는 입금된 거래액에 대해서 책임을 지지 않습니다.

3. 물품의 전달 확인 : 구매자는 ‘마이페이지’를 통하여 물품 인수확인을 하여야 합니다. 구매자가 물품 인수확인을 하지 않을 경우 회사에서는 판매자에 대한 대금지급을 보류할 수 있습니다.

4. 물품대금의 판매자 및 판매금액 송금

① 물품을 전달받은 구매자가 [물품인수 확인] 버튼을 클릭하여 물품수령을 회사로 통보한 경우, 회사는 거래금액에서 제23조에서 규정한 거래 수수료금액을 제외한 금액을 판매자에게 적립합니다.
② 구매자의 인수확인 지연으로 인한 적립지연에 대하여 회사는 아무 책임이 없으며 구매자가 책임집니다.
③ 회사 서비스를 이용하는 과정에서 회사가 취득하게 되는 이자 수입은 회사가 물품대금 결제를 위한 서비스를 제공하는 대가로서의 성질을 가지며, 회원은 이에 대한 반환을 청구할 수 없습니다.

5. 반품과 환불

① 회사가 판매자에게 물품대금을 지급하기 전이면, 구매자는 수령한 물품에 대한 환불을 회사에 요청할 수 있습니다. 다만, 회사는 환불에 대하여 판매자의 동의가 있는 경우에만 구매자에게 환불절차를 진행합니다.
② 판매자는 정당한 반품 요구를 들어줄 의무가 있습니다. 단, 구매자가 '인수확인'을 클릭하여 판매자에게 물품대금이 회사로부터 송금된 후에는 회사는 반품 및 환불 과정에 일체 관여하지 않고 거래당사자와 협의로 진행합니다.
③ 구매자가 반품을 하려면 사전에 판매자와 연락을 취하여 서로 합의 하여야 하며 회사는 이에 대하여 관여하지 않고 판매자 구매자 쌍방이 개별적으로 해결하여야 합니다.
④ 물품을 반품하고자 하는 경우, 구매자는 물품을 판매자에게 이상 없이 전달하여야 하며 구매자의 물품전달과 관련하여 회사는 아무런 책임이 없습니다.
⑤ 거래 취소 중 판매자 구매자 협의가 되지 않는 경우 아이디팜측에서 계정,아이템 전달 여부를 확인 한 뒤 1차적으로 협의가 되지 않을 시 24시간 뒤 단순변심, 물품상세화면과 다른 사유로 강제취소, 강제인수처리가 될 수 있습니다.
⑥ 유료상품(전자계약서) 반품의 경우 계약서 발송시점 이후에 발생된 분쟁은 귀책사유에 따라 귀책자에게 상품금액을 지불 할 수 있습니다.
⑦전자계약서는 구매자가 인수 후 판매자,구매자에게 동시에 발송되며, 당사에 상의,통보없이 거절하거나 타인명의로 작성,오기재,번호 변경,단순변심,거래취소등의 사유로 인한 재발송은 과실에 따라 재발송 비용을 청구 할 수 있습니다.
⑧ 아이디팜은 실시간 채팅기능내 취소 사유 확인이 불가한 상태에서 취소요청이 접수 되는 경우 사후사고방지를 목적으로 개별적(아이디팜 채팅 제외)으로 연락한 내용에 대해 확인요청을 진행 할 수 있으며, 취소사유 확인이 되지 않는 경우 보류할 수 있습니다.

6. 구매자의 의무

① 구매자는 물품에 대하여 구매 신청을 하였을 경우 물품대금을 결제하여야 합니다.
② 마일리지 결제의 경우 구매금액을 회사가 지정하는 방법으로 충전 후 결제를 완료 하여야 합니다.
③ 신용카드 결제와 휴대폰 결제의 경우 회사가 지정한 온라인 결제 대행업체(PG사)를 통하여 결제를 하여야 합니다.
④ 판매자가 판매 거부 시 구매자는 즉시 회사에 해당사실을 통보하여야 합니다. 
⑤ 구매자가 구매를 취소하기 위해서는 구매자가 회사에 대금을 입금 완료한 때로부터 24시간 이내에 구매취소 신청을 해야 합니다. 다만, 회사가 대금을 판매자에게 지급한 이후에는 구매취소를 할 수 없습니다.
⑥ 판매자가 판 물품에 하자가 있거나 물품 등록 정보와 상의한 경우 구매자는 정당하게 구매를 취소할 수 있습니다 .

7. 판매자의 의무

① 판매자는 구매자와 연락하여 입금 확인된 물품을 전달해야 합니다.
② 구매자가 정당한 사유 없이 구매거부 시 판매자는 즉시 회사에 해당사실을 통보하여야 합니다. 
③ 판매자가 판매를 취소하기 위해서는 구매자가 회사에 대금을 입금완료한 때로부터 24시간 이내에 판매취소 신청을 해야 합니다. 다만, 회사가 대금을 판매자에게 지급한 이후에는 판매취소를 할 수 없습니다.
④ 구매자의 정당한 구매취소 및 반품에 대하여 판매자는 이를 들어줄 의무가 있습니다.

[제19조 구매안전서비스]

1. 회사는 구매자가 지급하는 결제대금을 예치하고 거래완료 후 물품대금을 판매자에게 지급함으로써 구매자의 안전을 도모합니다.
2. 회사는 판매자가 인수한 일로부터 1일 이내에 구매자가 [인수확인]을 클릭하지 않는 경우에는 판매자에게 물품대금을 지급할 수 있습니다. 다만, 회사가 판매자에게 결제대금을 지급하기 이전에 구매자가 취소 의사를 표시한 경우에는 그 지급을 보류할 수 있습니다.
3. 거래의 자동종료

① 계약이 성립된 일로부터 1일이 경과하도록 구매자로부터 인수확인, 취소, 환불 등에 관한 의사표시가 없는 경우 회사는 구매자에게 이러한 사실을 통지하고 구매자에게 의사표시를 요청합니다. 회사의 통지 발송일로부터 1일 이내에도 구매자의 의사표시가 없는 경우에는 회사는 구매자에게 인수확인 의사가 있는 것으로 간주하여 자동인수확인(이하 “자동인수확인”이라 합니다.)을 할 수 있습니다.
② 회사는 구매자의 인수확인 의사가 있다고 간주하는 경우 [전자상거래 등에서의 소비자보호에 관한 법률]의 관련 규정에 따라 물품대금을 판매자에게 지급할 수 있습니다.
③ 자동인수확인이 이루어진 경우 구매자는 물품의 미수령 또는 취소, 반품, 환불 등의 사유로 회사에 대하여 이의를 제기할 수 없으며, 판매자와 구매자가 개별적으로 해결하여야 합니다.
④ 특수물품 계약성립에 있어 단순변심에 의한 거래취소는 판매자 동의 없이 불가하며, 1항에 의거 아이디팜 내부정책사항에 따라 자동인수확인(이하 “자동인수확인”이라 합니다.)을 할 수 있습니다.

[제20조 (게임물품거래 관련 중개서비스 수수료의 내용)]

회사는 판매자에게 인터넷을 통한 서비스를 제공하는 대가로 거래 종료 시점에서 다음과 같은 수수료를 부과합니다.

1. 구매수수료는 구매 유형(보증구매 등)에 따라 건당 부과될 수 있습니다.
2. 판매수수료는 건당 부과합니다. 내용은 아래와 같습니다.

가) 캐릭터 : 거래금액의 5%
나) 아이템/게임머니/쿠폰 : 거래금액의 5%

4. 수수료는 거래가 정상적으로 종료되었을 때 판매자에게 부과하는 것을 원칙으로 합니다.
5. 부가 수수료 : 회사에서 제공하는 부가서비스에 대한 대가로 부가서비스신청자에게 부과됩니다.

[제21조(아이템거래 관련 서비스 수수료 부과 방법)]

물품거래가 정상 종료되어 판매자에게 물품대금을 적립할 경우 회사는 제19조에서 규정한 해당 거래의 수수료를 제외하고 적립합니다.

[제 22 조(아이템거래 관련 서비스 수수료 부과의 예외)]

1. 회사가 수수료를 부과하지 않기로 결정한 거래에 대해서는 수수료를 부과하지 않습니다.
2. 구매자가 '물품인수확인' 버튼을 클릭하여, 물품대금이 판매자에게 송금된 후에 반품이나 환불이 될 경우에도 해당거래로 징수된 수수료는 환불되지 않습니다.

[제23조(마일리지)]

1. 마일리지란 회사에서 지정한 관련 서비스에서 사용되는 가상의 화폐를 지칭하며 1:1비율로 회사에서 지정하는 방식을 통하여 현금으로 환불이 가능합니다.
2. 회사는 물품의 거래가 종료되었을 때 판매대금을 판매자에게 마일리지로 적립함을 원칙으로 합니다.
3. 회사는 이벤트 등으로 회원에게 임의적으로 마일리지를 부여 할 수 있습니다.
4. 3항에 의하여 부여된 마일리지는 회사 사정으로 마일리지 적용이 취소 될 수도 있습니다.
5. 3항에 의하여 부여된 마일리지에 대하여 회사는 현금 환불을 제한 또는 금지할 수 있습니다. 그 경우에도 구매를 위한 사용은 가능합니다.
6. 회원 탈퇴 시 또는 서비스 이용계약 해지 시 본조항에 의하여 부여된 마일리지는 전액 삭제 됩니다.
7. 회사는 마일리지에 대한 금융이자 지급 의무가 없습니다.
8. 무통장입금, 가상계좌, 신용카드등 단순입출금 시 대출사기, 보이스피싱 자금세탁관련 보호조치의무강화로 출금사유에 대해 확인을 요청 할 수 있으며, 로그등을 확인하여 비정상이용으로 확인되는 경우 마일리지 출금을 보류 후 입금출처를 확인 할 수 있습니다.
8-1. 회원 가입 7일 이내에 단순 입출금으로 확인되는 경우, 24시간동안 출금을 제한할 수 있으며, pg사,van사에 입금 출처 확인 후 출금 처리 됩니다.
9. 당사 채팅시스템 이용을 통해 거래에 필요한 정보습득 및 타플랫폼 유도 거래 정책위반사항에 대해 제3자사기 방지를 위해  해당 소명여부에 따라 24시간 출금을 보류할 수 있습니다.

제 24 조 (책임제한)
① “회사”는 천재지변 또는 이에 준하는 불가항력으로 인하여 “서비스”를 제공할 수 없는 경우에는 “서비스” 제공에 관한 책임이 면제됩니다.
② “회사”는 “회원”의 귀책사유로 인한 “서비스” 이용의 장애에 대하여는 고의 또는 중과실이 없는 한 책임을 지지 않습니다.
③ “회사”는 “회원”이 “서비스”와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 고의 또는 중과실이 없는 한 책임을 지지 않습니다.
④ “회사”는 “회원” 간 또는 “회원”과 제 3 자 상호간에 “서비스”를 매개로 하여 거래 등을 한 경우에는 회사의 고의 또는 중과실이 없는 한 책임이 면제됩니다.
⑤ “회사”는 무료로 제공되는 서비스 이용과 관련하여 관계 법령에 특별한 규정이 없는 한 책임을 지지 않습니다.

제 25 조 (권리, 의무의 양도금지)
"회원"은 "회사"의 사전 서면동의 없이 이 약관상의 권리 또는 의무의 전부 또는 일부를 제3자에게 양도, 이전, 증여하거나 이를 담보로 제공할 수 없습니다.

제 26 조 (준거법 및 재판관할)
① “회사”와 “회원”간 제기된 소송은 대한민국법을 준거법으로 합니다.
② “회사”와 “회원” 간 발생한 분쟁에 관한 소송은 제소 당시의 “회원”의 주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속관할로 합니다. 단, 제소 당시 “회원”의 주소 또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.
`;

return PrivacyAgreeText;
}

export default PrivacyAgree;



