let question = [
  {
    no: `질문1`,
    member:{username: '관리자', name: "admin"},
    createDate: "2023-11-07",
    title: "Q. 어떻게 거래하는 건가요?",
    content: 
      `
      안녕하세요 
  
      게임 거래소 사이트명입니다.
  
      우선 저희 사이트를 이용해주셔서 감사합니다.
  
      간단하게 설명드리는 구매절차입니다.

      1. 물품 가격에 맞게 마일리지 충전
      2. 물품에 들어가서 구매 요청
      3. 문자 또는 전화로 물품받기
      4. 판매자는 인계하기 / 구매자는 인수하기 버튼 클릭하기
      5. 거래 종료

      다른 궁금한 점이 있으시면 1:1문의 또는 고객센터로 문의주시면 성실하게 답변해드리겠습니다.

      감사합니다 :)
      `
  },
  {
    no: '질문2',
    member:{username: '관리자', name: "admin"},
    createDate: "2023-11-07",
    title: "Q. 입출금 수수료는 얼마인가요?",
    content: 
      `
        판매자 구매자 모두 마일리지 입출금시 발생하는 수수료는 전혀 없습니다. 
        
        더 궁금하신 점이 있으시면 고객센터 또는 1:1문의를 주시면 빠른 답변해드리겠습니다.
         
        감사합니다.
      `
  },
  {
    no: '질문3',
    member:{username: '관리자', name: "admin"},
    createDate: "2023-11-07",
    title: "Q. 거래등급별 혜택은 어떤게 있나요?",
    content: 
      `
       현재 해당 서비스는 준비중입니다.

       최대한 빨리 준비를 끝마쳐 고객님께 풍성한 혜택을 드릴 수 있도록 하겠습니다.

       양해부탁드립니다 !
      `
  },
  {
    no: '질문4',
    member:{username: '관리자', name: "admin"},
    createDate: "2023-11-07",
    title: "Q. 구매자가 인수처리를 안해요",
    content: 
      `
       구매자분께서 인수처리 버튼을 누르시는걸 깜박하는 경우가 많습니다.

       해당 경우 크게 걱정안하셔도 되며

       마이페이지를 접속하시어 구매자에게 휴대전화번호로 연락해서 전달해주시거나 

       고객센터 또는 1:1문의를 주시면 최대한 빠른 해결을 도움 드리겠습니다.
       (문의시 구매자 아이디와 함께 구매한 금액을 기재부탁드립니다.)

       감사합니다 .
      `
  },
  {
    no: '질문5',
    member:{username: '관리자', name: "admin"},
    createDate: "2023-11-07",
    title: "Q. 비밀번호를 잊어버렸어요",
    content: 
      `
       비밀번호 분실시 로그인화면에서 아이디/비밀번호 찾기를 통해 

       휴대전화번호를 입력 후 해당 아이디의 비밀번호를 재설정하실 수 있습니다.

       감사합니다.
      `
  }
]

export default question;