let question = [
  {
    id: 1,
    member:{username: '관리자', name: "admin"},
    createdate: "2023-11-07",
    title: "Q. 어떻게 거래하는 건가요?",
    content: 
      `
      안녕하세요 
  
      게임 거래소 사이트명입니다.
  
      우선 저희 사이트를 이용해주셔서 감사합니다.
  
      간단하게 설명드리는 구매절차입니다.

      1. 물품 가격에 맞게 마일리지 충전
      2. 물품에 들어가서 구매 요청
      3. 채팅으로 계정을 전달 받기 및 정보 변경
      4. 판매자는 인계하기 / 구매자는 인수하기 버튼 클릭하기
      5. 거래 종료

      다른 궁금한 점이 있으시면 1:1문의 또는 고객센터로 문의주시면 성실하게 답변해드리겠습니다.

      감사합니다 :)
      `
  },
  {
    id: 2,
    member:{username: '관리자', name: "admin"},
    createdate: "2023-11-07",
    title: "Q. 입출금 수수료는 얼마인가요?",
    content: 
      `
        판매자 구매자 모두 마일리지 입출금시 발생하는 수수료는 전혀 없으며, (마일리지 충전 시 결제방식은 8가지이며 무통장입금의 경우 수수료 0원)

        판매자
      `
  }
]

export default question;