let server = {
  ServerSelect : [
    '서버전체',
    '기타'
  ],

  LOL : [
    '서버전체',
    '기타'
  ],

  SuddenAttack : [
    '서버전체',
    '기타'
  ],
  Fifa : [
    '서버전체',
    '기타'
  ],
  CookieRun : [
    '서버전체',
    '기타'
  ],

  MaypleStory : [
    '아케인',
    '리부트',
    '엘리시움',
    '이노시스',
    '스카니아',
    '크로아',
    'RED',
    '버닝2',
    '오로라',
    '노바',
    '리부트',
    '루나',
    '유니온',
    '베라',
    '제니스',
    '테스피니아',
    '버닝',
    '아르테일'
],

  LostArk : [
    '카단',
    '카마인',
    '니나브',
    '실리안',
    '아브렐슈드',
    '루페온',
    '카제로스',
    '아만'
  ],

  DF : [
    '디레지에',
    '시로코',
    '카시아스',
    '프레이',
    '스타트',
    '바칼',
    '안톤',
    '카인',
    '힐터'
  ],

  BattleGrounds : [
    '카카오',
    '스팀'
  ]


}

export default server;